# Johnny's MySQL Connection String (Project 3)

After looking at several connectors, I settled on pymsql to connect to a mysql database.  It's not installed by default in Anaconda so I installed it using the conda installer at the MS Windows Command prompt

'conda install pymysql'

After the installation, pymysql was imported.

In [36]:
import pymysql
import pandas as pd

The mysql connection string along with the sql statement creates the 'df' dataframe with the data.

In [37]:
df = pymysql.connect(host='localhost',  
                       port=3306,  
                       user='root',  
                       passwd='root',  
                       db='chinook',  
                       charset='utf8')
cur = df.cursor()

sql = """SELECT customer.LastName, customer.FirstName, track.Name, album.Title FROM customer
        INNER JOIN invoice ON customer.CustomerId = invoice.CustomerId
        INNER JOIN invoiceline ON invoice.InvoiceId = invoiceline.InvoiceId
        INNER JOIN track ON invoiceline.TrackId = track.TrackId
        INNER JOIN album ON track.AlbumId = album.AlbumId
        ORDER BY customer.LastName"""
              
cur.execute(sql)
cur.close
df.close

Finally, I read the dataframe that resulted from the mysql connection and query.

In [38]:
pd.read_sql(sql, df).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas